'''

#TODO Напишіть будь-яку програму.
Можна друкувати якусь історію, діалог, можна малювати малюнки за допомогою зірочок та інших символів. 

Зробіть те, що Вам цікаво — головне, щоб ця програма працювала!

'''

print("Привіт! Як тебе звати?")
name = input()
print(f"Приємно познайомитися, {name}!")

print("Як твій день?")
unswear = input()
print(f"О, як чудово! Мій день теж добре почався.")

print("Що ти любиш робити у вільний час?")
hobby = input()
print(f"Це цікаво! Я теж люблю {hobby}.")

print("До побачення! Будьте пильні та майте гарний день.")
