'''
Етап «Правила гри»
Використовуй команду print (), щоб привітатися з гравцем і пояснити йому правила гри.

Етап «Питання-відповідь»: генерація задуманого числа
Нехай програма загадає число. Для цього підключи модуль random і використовуй команду randint (a, b), де a і b - межі, в яких потрібно видати випадкове число.

Етап «Питання-відповідь»: введення числа користувачем
Запросіть у користувача його варіант відповіді за допомогою команди input ().

Етап «Питання-відповідь»: підказки
Порівняте за допомогою умовного оператора введене користувачем число з задуманим. Якщо вони не збігаються, виведи підказку, більше загадане число або менше введеного варіанти відповіді.

Етап «Питання-відповідь»: повтор введення
Додате в програму цикл, щоб користувач міг повторно вводити варіант відповіді, поки не відгадає.

Етап «Результат гри»
Привітай користувача з перемогою і виведи на екран загадане число.

Бонус: додате в програму підрахунок спроб!
'''


import random

def welcome():
    print("Ласкаво просимо у гру 'Вгадай число'!")
    print("Правила гри:")
    print("1. Я загадаю число від 1 до 100.")
    print("2. Ваше завдання - вгадати це число.")
    print("3. Після кожного введення вами числа, я вам дам підказку, чи більше, чи менше загадане число.")
    print("4. Гра триватиме, поки ви не вгадаєте число. Удачі!")

def play_game():
    secret_number = random.randint(1, 100)
    attempts = 0

    while True:
        user_guess = int(input("Введіть ваш варіант числа: "))
        attempts += 1

        if user_guess == secret_number:
            print(f"Вітаємо! Ви вгадали число {secret_number} за {attempts} спроб.")
            break
        elif user_guess < secret_number:
            print("Загадане число більше вашого варіанту.")
        else:
            print("Загадане число менше вашого варіанту.")

if __name__ == "__main__":
    welcome()
    play_game()


