'''обмеження 13 рядків
Напишіть програму, яка просить користувача ввести ширину та довжину кімнати. 
Після того коли ці значення були прочитані, ваша програма повинна обчислити та 
відобразити площу кімната. Довжину та ширину буде введено як числа з 
плаваючою комою. Включати одиниці у вашому запиті та вихідному 
повідомленні; або фути, або метри, залежно від тої
одиниці, з якою вам зручніше працювати
'''


length_unit = input("Введіть одиниці довжини (фути/метри): ")
width_unit = input("Введіть одиниці ширини (фути/метри): ")

length = float(input(f"Введіть довжину кімнати у {length_unit}: "))
width = float(input(f"Введіть ширину кімнати у {width_unit}: "))

area = length * width
print(f"Площа кімнати: {area} {length_unit}²")
