'''
У Сполучених Штатах паливна ефективність для транспортних засобів 
зазвичай виражається в милях на галон (MPG). 
У Канаді паливна економічність зазвичай виражається 
в літрах на сто кілометрів (л/100 км). 
Використовуйте свої дослідницькі навички,
щоб визначити, як перетворити з MPG на L/100 км. 
Потім створіть програму, яка зчитує значення від користувача 
в американських одиницях і відображає еквівалентну паливну 
ефективність в канадських одиницях.

'''



conversion_factor = 235.214583


mpg = float(input("Введіть паливну ефективність в милях на галон (MPG): "))


liters_per_100_km = conversion_factor / mpg


print(f"Еквівалентна паливна ефективність в літрах на 100 км: {liters_per_100_km:.2f} л/100 км")
