'''
Розглянемо програмне забезпечення, яке працює на автоматі самообслуговування. 
Одне із завдань, яке він повинен мати можливість виконати, 
- визначити, скільки змін надати, коли покупець оплачує покупку готівкою.
Напишіть програму, яка починається з читання кількості центів 
від користувача цілим числом. Потім ваша програма повинна обчислити 
та відобразити номінали монет, які слід використовувати, 
щоб надати цю суму здачі покупцеві. Здачу слід давати, 
використовуючи якомога менше монет. Припустимо, 
що машина завантажена пені (1), нікелями(5), копійками(10), четвертаками(25), 
луні(1$) та туні(2$).

'''





cents = int(input("Введіть кількість центів: "))


dollars = cents // 100
cents %= 100

quarters = cents // 25
cents %= 25

dimes = cents // 10
cents %= 10

nickels = cents // 5
cents %= 5

pennies = cents

print(f"Монети для здачі: {dollars} доларів, {quarters} четвертаків, {dimes} дімів, {nickels} нікелів, {pennies} пені")
