'''
Напишіть програму, яка обчислює індекс маси тіла (ІМТ) людини. 
Ваша програма повинна починатися з читання зросту і ваги користувача. 
Потім слід використовувати одну з наступних двох формул для обчислення 
ІМТ перед його відображенням. Якщо читати зростання в дюймах і вага в фунтах, 
то індекс маси тіла розраховується за такою формулою:

                    BMI = (weight / height × height) × 703

Якщо читати зростання в метрах, а вага в кілограмах, 
то індекс маси тіла розраховується за такою трохи більш простою формулою:

                    BMI = (weight / height × height)

Користувачу потрібно надати можливість обрати одиниці виміру




'''




unit_choice = input("Виберіть одиниці виміру (1 - фунти та дюйми, 2 - кілограми та метри): ")

if unit_choice == '1':
    weight = float(input("Введіть вагу у фунтах: "))
    height = float(input("Введіть зріст у дюймах: "))
    bmi = (weight / (height * height)) * 703
else:
    weight = float(input("Введіть вагу у кілограмах: "))
    height = float(input("Введіть зріст у метрах: "))
    bmi = weight / (height * height)


print(f"Індекс маси тіла: {bmi:.2f}")
