'''
Напишіть будь-який діалог з комп'ютером, який захочете!
'''


print("Привіт! Як тебе звуть?")
name = input()

print(f"Приємно познайомитися, {name}! Як я можу тобі допомогти сьогодні?")

print("Що цікавить тебе?")
interests = input()

print(f"О, {interests} - це цікава тема! Якщо у тебе є які-небудь питання або потрібна інформація, не соромся запитати.")

print("А ще, якщо ти хочеш, я можу порекомендувати тобі книгу або фільм. Що скажеш?")
response = input()

if response.lower() == "так":
    print("Чудово! Зараз подивимося, які книги та фільми можливо порекомендувати.")
    
else:
    print("Жодної проблеми. Якщо є щось ще, звертайся!")
