'''
Бонусне завдання. 
Придумайте свій діалог з комп'ютером! 
Нехай комп'ютер ставить запитання користувачеві, а той йому відповідає. 
Не соромтеся експериментувати з командами, які Ви вже знаєте!
Обов'язково придумайте і використовуйте свою власну ідею! 
Просто реалізуйте свою задумку.
'''


print("Привіт! Я твій веселий комп'ютерний помічник.")


mood = input("Як у тебе сьогодні настрій? ")


if "гарний" in mood.lower():
    print("Це чудово! Що ти б хотів сьогодні робити?")
else:
    print("Не переймайся, сьогодні ще може статися багато цікавого. Як я можу допомогти тобі?")


favorite_food = input("Скажи, яка твоя улюблена страва? ")


print(f"О, {favorite_food} - чудовий вибір! Можливо, якщо ти просиш гарно, якось відіграєш її рецепт?")


print("Дякую за розмову! Я завжди тут, якщо тобі потрібна допомога чи просто спілкування.")
