'''
На змагання з квідичу прийшло n студентів. 
Їм необхідно об'єднатися в дві команди. 
Для цього кожному учаснику видали свій унікальний номер. 
Гамблдор оголосив, що всі учасники з непарними номерами 
гратимуть в команді «Гріфендор», а всі інші - в команді «Слизерін». 
Виведіть у стовпчик номери всіх дітей, які будуть грати в команді «Гріфендор».
Користувач вводить число n - число дітей, які прийшли на змагання. 
Програма повинна вивести в стовпчик всі номери гравців команди «Гріфендор» 
- непарні числа від 1 до n.
'''

n = int(input("Введіть кількість студентів: "))


i = 1
while i <= n:
    if i % 2 != 0:
        print(i)
    i += 1
