'''
Бонусне завдання. 
Придумайте свій чат-бот! 
Не соромтеся експериментувати з командами, які Ви вже знаєте!
Обов'язково придумайте і використовуйте свою власну ідею! 
'''

print("Привіт! Я твій чат-бот. Як справи?")

mood = input("Як твій настрій сьогодні? ")

if "щаслив" in mood.lower():
    print("Це чудово, я радію за тебе!")
elif "сумний" in mood.lower():
    print("Не переймайся, можливо, я зможу тебе розвеселити.")
else:
    print("Цікаво, що ти сьогодні відчуваєш.")

print("Я завжди тут, якщо тобі потрібна підтримка чи розмова. До побачення!")
