'''
Придумайте свій діалог з комп'ютером!

Обов'язково придумайте і використовуйте свою власну ідею!

Використовуйте вкладені умовні оператори.
Питання, які задає комп'ютер, повинні змінюватися в залежності 
від попередніх відповідей людини.
'''



print("Привіт! Я твій віртуальний компаньйон. Як тебе звати?")


name = input("Мене звуть: ")

print(f"Приємно познайомитися, {name}! Як я можу тобі допомогти сьогодні?")


ask_hobby = True
ask_feeling = False


while True:
    if ask_hobby:
        hobby = input("Розкажи мені про своє хобі: ")
        print(f"О, цікаве хобі, {name}! Як часто ти цим займаєшся?")
        ask_hobby = False
        ask_feeling = True
    elif ask_feeling:
        frequency = input("Як ти себе почуваєш, роблячи це? Добре/Погано: ")
        if frequency.lower() == 'добре':
            print(f"Це чудово, {name}! Так тримати!")
        else:
            print(f"Не переймайся, {name}, буває. Важливо робити те, що приносить радість!")
        ask_feeling = False
        break 
