'''
Вигадай діалог.
Вигадай діалог і виведи його на екран, використовуючи функцію print ().
'''

print("_____________________________________")
print("Привіт як перший день навчання в УКД!")
print("_____________________________________")
print("Привіт, насправді все супер!")
print("_____________________________________")
print("І як тобі наші викладачі?")
print("_____________________________________")
print("Прекрасні люди, дуже радий, що нас навчають саме вони!")
print("_____________________________________")