'''
Напиши історю битви
Вигадай історію битви двох супергероїв та виведи її на екран, використовуючи функцію print() та метод format. Не забувай, що весь текст має бути написаний всередині потрійних лапок.
'''


hero1_name = "Thunderstrike"
hero1_power = "control of lightning"

hero2_name = "Shadowblade"
hero2_power = "ability to manipulate shadows"

story_template = """
У захмарних небесах міста відбулась захоплююча битва між двома супергероями.

Супергерой по імені {hero1_name}, володар сили молний, стояв на одному полюсі. Зі своєю неймовірною здатністю керувати блискавкою, він робив кожен його удар точним та потужним.

Йому протистояв супергерой {hero2_name}, що володіє надзвичайною здатністю маніпулювати тінями. Він, як тінь, підкрадався до свого суперника, роблячи кожен його рух непередбачуваним та загадковим.

Битва тривала довго, і обидва супергерої витрачали всі свої сили, намагаючись перемогти один одного. {hero1_name} блискавкою сяяв на небосхилі, викликаючи грім, тоді як {hero2_name} майстерно ховався у тіні, використовуючи її для своєї вигоди.

У кінці, коли всім здавалося, що переможець невизначений, {hero1_name} і {hero2_name} вирішили припинити свою битву. Розуміючи, що кожен з них має свою роль у цьому світі, вони об'єднали свої сили, використовуючи контроль над блискавкою та тінями, для захисту міста від нового, спільного ворога.

І так закінчилась захоплююча історія битви, що вибудувала міцність та взаєморозуміння серед супергероїв.
"""

print(story_template.format(hero1_name=hero1_name, hero1_power=hero1_power, hero2_name=hero2_name, hero2_power=hero2_power))
