'''
Заведіть змінну answer і запишіть туди правильну відповідь.
Використовуйте функцію input, щоб загадати загадку користувачеві
і записати його відповідь в нову змінну.

В умовному операторі порівняйте відповідь користувача з answer. 
Якщо відповідь вірна, то привітайте користувача з правильною відповідю. 
Якщо немає - висловіть співчуття.
'''


riddle = "Що літає без крил?"

answer = "трамвай"


user_answer = input("Відгадай загадку: ")


if user_answer.lower() == answer:
    print("Вірно! Ви молодець!")
else:
    print("Спробуйте ще раз. Правильна відповідь: трамвай.")
