'''
!LOOPS

Напишіть програму, яка відображає таблицю перетворення температури градусів 
Цельсія і градусів Фаренгейта. 
Таблиця повинна включати рядки для всіх температур від 0 до 100 градусів Цельсія, 
кратних 10 градусам Цельсія. Додайте відповідні заголовки до стовпців. 
Формулу перекладу між градусами Цельсія і градусами Фаренгейта можна знайти в 
інтернеті.


'''



print("Градуси Цельсія  |  Градуси Фаренгейта")
print("----------------------------------")


for celsius in range(0, 101, 10):
  
    fahrenheit = (celsius * 9/5) + 32
    
    print(f"{celsius:^15} | {fahrenheit:^20}")

