'''
Тривалість місяця варіюється від 28 до 31 дня. 
У цій вправі ви створите програму, 
яка читає назву місяця від користувача у вигляді рядка. 
Тоді ваша програма повинна відображати кількість днів у цьому місяці.
Відобразіть «28 або 29 днів» для лютого, щоб зверталися до високосних років.

'''

month = input("Введіть назву місяця: ")


if month == "січень" or month == "березень" or month == "травень" or month == "липень" or month == "серпень" or month == "жовтень" or month == "грудень":
    print("У цьому місяці 31 день.")
elif month == "квітень" or month == "червень" or month == "вересень" or month == "листопад":
    print("У цьому місяці 30 днів.")
elif month == "лютий":
    print("У цьому місяці 28 або 29 днів (залежно від високосного року).")
else:
    print("Введено неправильну назву місяця. Будь ласка, введіть коректну назву.")
