'''
Створіть програму, яка читає місяць і день від користувача.
Користувач введе назву місяця як рядок, а потім день у межах місяця як ціле число. 
Потім у вашій програмі повинен відобразитися сезон, пов'язаний з датою, 
яка була введена.

'''

month = input("Введіть місяць (наприклад, січень): ")
day = int(input("Введіть день: "))


if (month == "грудень" and day >= 21) or (month == "січень") or (month == "лютий") or (month == "березень" and day < 21):
    season = "зима"
elif (month == "березень" and day >= 21) or (month == "квітень") or (month == "травень") or (month == "червень" and day < 21):
    season = "весна"
elif (month == "червень" and day >= 21) or (month == "липень") or (month == "серпень") or (month == "вересень" and day < 23):
    season = "літо"
elif (month == "вересень" and day >= 23) or (month == "жовтень") or (month == "листопад") or (month == "грудень" and day < 21):
    season = "осінь"
else:
    season = "невідомий сезон"

print(f"Сезон для {month} {day}-го: {season}")
